tap "anomalyco/tap"
tap "libsql/sqld"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "tursodatabase/tap"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "btop"
brew "chruby"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "jq"
brew "lazygit"
brew "mosh"
brew "mysql@8.0", restart_service: :changed, link: true
brew "mysql@8.4"
brew "neovim"
brew "node"
brew "node@20"
brew "playwright-cli"
brew "pytest"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ruby-install"
brew "sshuttle"
brew "temporal"
brew "tmux"
brew "tokei"
brew "yazi"
brew "anomalyco/tap/opencode"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "cmux"
cask "codex"
cask "codex-app"
cask "cursor"
cask "docker-desktop"
cask "flutter"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "iterm2"
cask "ledger-wallet"
cask "raycast"
cask "steam"
cask "superwhisper"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "anysphere.remote-wsl"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "jock.svg"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
go "github.com/bootdotdev/bootdev"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
