tap "anomalyco/tap"
tap "homebrew/services"
tap "stripe/stripe-cli"
brew "azure-cli"
brew "bat"
brew "chruby"
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "jq"
brew "lazygit"
brew "mosh"
brew "mysql@8.0", restart_service: :changed, link: true
brew "mysql@8.4"
brew "neovim"
brew "node@20"
brew "pytest"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ruby-install"
brew "sshuttle"
brew "temporal"
brew "tmux"
brew "anomalyco/tap/opencode"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
cask "font-hack-nerd-font"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clemenspeters.format-json"
vscode "cliffordfajardo.highlight-line-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hwencc.html-tag-wrapper"
vscode "ionutvmi.path-autocomplete"
vscode "jock.svg"
vscode "johnpapa.vscode-cloak"
vscode "kamikillerto.vscode-colorize"
vscode "linkedin.linkedin-multiproduct-vscode-plugin-pack"
vscode "linkedin.linkedin-vscode-inclusive-language"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "stylelint.vscode-stylelint"
vscode "suchitadoshi1987.vscode-ember-experimental"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
go "github.com/bootdotdev/bootdev"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
