tap "anomalyco/tap"
tap "homebrew/services"
tap "stripe/stripe-cli"
brew "azure-cli"
brew "bat"
brew "chruby"
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "jq"
brew "lazygit"
brew "mosh"
brew "mysql@8.0", restart_service: :changed, link: true
brew "mysql@8.4"
brew "neovim"
brew "node@20"
brew "pytest"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ruby-install"
brew "sshuttle"
brew "temporal"
brew "tmux"
brew "yazi"
brew "anomalyco/tap/opencode"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "docker-desktop"
cask "flutter"
cask "font-hack-nerd-font"
cask "ghostty"
cask "iterm2"
cask "ledger-wallet"
cask "raycast"
cask "steam"
cask "superwhisper"
go "github.com/bootdotdev/bootdev"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
